{
  "status": "ACTIVATING_AUTOMATIC_EULA_ACCEPTED",
  "eulaText": "END USER LICENSE AGREEMENT\r\nDOC-0355-12\r\n\r\n\r\nIMPORTANT - READ BEFORE INSTALLING OR OPERATING THIS PRODUCT\r\n\t\r\nLICENSEE (\"LICENSEE\") AGREES TO BE BOUND BY THE TERMS OF THIS AGREEMENT BY \r\nINSTALLING, HAVING INSTALLED, COPYING, OR OTHERWISE USING THE PRODUCT.  \r\nIF LICENSEE DOES NOT AGREE, DO NOT INSTALL OR USE THE PRODUCT.\r\n\t\r\n1.\tScope.  This End User License Agreement (\"License\") applies to the \r\nsoftware product (\"Software\") Licensee has licensed from F5.  All references to \r\n\"F5\" in this License will be deemed to be a reference to the applicable F5 \r\nentity as follows: (i) if Licensee's primary place of business is located in the \r\nEuropean Economic Area, the Middle East or Africa (\"EMEA\"), the F5 entity is F5 \r\nNetworks Ltd.; (ii) if Licensee's primary place of business is located in the \r\nAsia-Pacific region (\"APAC\"), the F5 entity is F5 Networks Singapore Pte Ltd; \r\nand (iii) if Licensee's primary place of business is located in a region \r\noutside of EMEA or APAC, the F5 entity is F5 Networks, Inc. Certain Software \r\nis licensed for use in conjunction with F5 hardware which together with the \r\nSoftware will be referenced as the \"Product.\" This License is a legal agreement \r\nbetween F5 and the single entity (\"Licensee\") that has acquired the Software \r\nfrom F5 under these terms and conditions.  \r\n\r\n2.\tLicense Grant.  Subject to the terms of this License, F5 grants to \r\nLicensee a non-exclusive, non-transferable license to use the Software during \r\nthe term for which Licensee has paid the required license fees in object code \r\nform for Licensee's internal business purposes.  Other than as specifically \r\ndescribed herein, no right or license is granted to any of F5's trademarks, \r\npatents, copyrights, or other intellectual property rights and F5 retains all \r\nrights not granted herein.  The Software incorporates certain third party \r\nsoftware, which is used subject to licenses from the respective owners.  \r\n\r\nLicensee understands that by using the Product, Licensee consents and agrees to \r\nthe collection and use of certain information about Licensee's Product, \r\nincluding but not limited to hardware serial number, appliance part number, disk \r\nconfiguration, memory amount, as well as periodic updates for software, \r\ndatabases, etc.  Licensee further consents and agrees that the Product may \r\ncollect, use, transmit to F5, process and maintain information related to the \r\nProduct for purposes of providing the Software, and any features therein. \r\nInformation collected by the Product and transmitted to F5 may also include \r\ntechnical or diagnostic information related to Licensee's use that may be used \r\nby F5 to support, improve and enhance F5's products and services. Licensee may \r\nopt out of the collection and use of such information by configuring the \r\nProduct to disable these features.\r\n\r\n3.\tRestrictions.  \r\n\r\n(a)\tThe Software, documentation and the associated copyrights and other \r\nintellectual property rights are owned by F5 or its licensors and are protected \r\nby law and international treaties.  Licensee may not copy or translate the \r\ndocumentation provided with the Software or available online at http://askf5.com \r\n(\"Documentation\") without F5's prior, written consent.  Licensee may install, \r\nuse, access, display and run the Software only in the manner in which it has been \r\nlicensed as indicated herein and in the applicable purchase order, quote or the \r\nlicense file for such Product or Software, including but not limited to any \r\nrestrictions on number of protected applications, number or type of licensed \r\ndevices, number of authorized copies or instances, number of users, bandwidth, \r\nnon-production use, database or location restrictions.  Licensee further agrees \r\nthat it will not defeat, circumvent or disable any copy protection mechanism or \r\nmechanism in the Software used to limit license duration or access to non-\r\nlicensed functionality or capacity, and that any such attempt will be a material \r\nbreach of this Agreement.  F5 reserves the right to audit Licensee's use of the \r\nSoftware or authorize others to conduct such an audit on its behalf and to \r\ndisable any application or functionality that has not been specifically licensed,\r\nin addition to any other rights and remedies available to F5.  \r\n\r\n(b)\tFor Software modules purchased in conjunction with a F5 device, the \r\nSoftware is not transferable to other F5 devices or third party hardware.  \r\nFor Software provided in stand-alone form (not embedded in a F5 hardware Product\r\n), Licensee may only install and use the Software in object code form on the \r\nserver(s) for which Licensee has a valid license key issued to it by F5 or its \r\nauthorized sub-licensor and only for the duration of the validity of such license \r\nkey.  The use of any hardware or software to pool resources or reduce the number \r\nof devices that directly access or use the Software (sometimes referred to as \r\n'virtualization') will not reduce the number of license keys required. Licensee \r\nmust have a separate license key for each instance of the Software. F5 may \r\nrestrict Licensee's use of the Software, by at least one of the following \r\nlocking methods: (i) an instance identifier; (ii) hypervisor in use; \r\n(iii) a bridge; and/or (iv) Media Access Control (MAC) address. Licensee agrees \r\nthat it will not attempt to circumvent any of the foregoing license key \r\nrestrictions or to have others do so on its behalf. \r\n\r\n(c)\tCertain portions of the Software include third party software modules, \r\nwhich may include, but are not limited to, MySQL licensed from MySQL AB or \r\nJavaTM licensed from Oracle America, Inc., and are subject to additional \r\nlimitations imposed by those third parties (\"Restricted Third Party Software\").  \r\nCertain portions of the Software may also include geographical or other data \r\n(\"Data\").  Licensee agrees that it will only use such Restricted Third Party \r\nSoftware or Data in conjunction with the Product and not as standalone \r\nsoftware. Licensee will not (i) copy the Restricted Third Party Software or \r\nData onto any public or distributed network; (ii) use the Restricted Third \r\nParty Software or Data separately to operate in or as a time-sharing, \r\noutsourcing, service bureau, application service provider or managed \r\nservice provider environment; (iii) use the Restricted Third Party Software\r\n or Data as a general server, as a standalone application or with applications \r\nother than the Software under this license; (iv) change any proprietary rights \r\nnotices which appear in the Restricted Third Party Software or Data; or \r\n(v) modify the Restricted Third Party Software or Data.  The protections given \r\nto F5 under this License also apply to the suppliers of this third party \r\nsoftware.\r\n\r\n(d)\tLicensee may not copy (except to make one archival copy for backup and \r\ndisaster recover purposes), modify, sell, sub-license, rent or transfer the \r\nSoftware, Data or any associated Documentation to any third party.  Licensee may \r\nnot disassemble, reverse compile or reverse engineer the Software or any Data \r\nincorporated in the Software or encourage others to do so except as required by \r\nlaw for interoperability purposes, and then only after Licensee has given \r\nSupplier an opportunity to provide information or software necessary to resolve \r\nsuch interoperability issues. \r\n\r\n4.\tExport Control.  F5's standard Product incorporates cryptographic \r\nsoftware.  Licensee agrees to comply with the Export Administration Act, the \r\nExport Control Act, all regulations promulgated under such Acts, and all other \r\nUS government regulations relating to the export of technical data and equipment \r\nand products produced therefrom which are applicable to Licensee.  Licensee \r\nfurther agrees not to disclose or transmit to F5 any information that requires \r\nthat access to such information be limited to US Nationals or personnel based in \r\na certain country or region.  In countries other than the US, Licensee agrees to \r\ncomply with the local regulations regarding importing, exporting or using \r\ncryptographic software. Licensee agrees it will not export or re-export the \r\nSoftware to any country, person, or entity subject to U.S. export restrictions. \r\nSpecifically, Licensee agrees not to export or re-export the Software: (i) to \r\nany country to which the U.S. has embargoed or restricted the export of goods \r\nor services, or to any national of any such country, wherever located, who \r\nintends to transmit or transport the Software back to such country; (ii) to \r\nany person or entity who Licensee knows or has reason to know will utilize \r\nthe Software or portion thereof in the design, development or production of \r\nnuclear, chemical or biological weapons; or (iii) to any person or entity who \r\nhas been prohibited from participating in U.S. export transactions by any \r\nfederal agency of the U.S. government, including but not limited to anyone \r\non the U.S. Treasury Department's list of Specially Designated Nationals or \r\nthe U.S. Department of Commerce's Table of Denial Orders. By installing or \r\nusing the Software, Licensee represents and warrants that it is not located in, \r\nunder control of, or a national or resident of any such country or on any such \r\nlist.\r\n\r\n5.\tLimited Warranty.  F5 warrants that for a period of 90 days from the \r\ndate of shipment: (i) the media on which the Software is furnished will be free \r\nof defects in materials and workmanship under normal use; and (ii) the Software \r\nsubstantially conforms to its published specifications.  Except for the \r\nforegoing, the Software is provided AS IS.  In no event does F5 warrant that \r\nthe Software is error free, that it will operate with any software or hardware \r\nother than that provided by F5 or specified in the documentation, or that the \r\nSoftware will satisfy Licensee's own specific requirements. \r\n\r\n(a)\tRemedy.  Licensee's exclusive remedy under this limited warranty is that \r\nF5, at F5's option, will repair or replace any Software that fails during the \r\nwarranty period at no cost to Licensee.  During the warranty period, F5 will \r\nreplace defective media or documentation or, at its option, undertake reasonable\r\nefforts to modify the Software to correct any substantial non-conformance with\r\nthe specifications.\r\n\r\n(b)\tRestrictions.  The foregoing limited warranties extend only to the \r\noriginal Licensee, and do not apply if the Software (i) has been altered, except \r\nby F5 or an F5-designated representative or in accordance with F5 instructions, \r\n(ii) has not been installed, operated, repaired, or maintained in accordance \r\nwith F5's instructions, (iii) has been subjected to abnormal physical or \r\nelectrical stress, misuse, negligence or accident or (iv) has been operated \r\noutside of the environmental specifications for the Software.  F5's limited \r\nsoftware warranty does not apply to software corrections or upgrades. \r\n\r\n6.\tNotice to U.S. Government End Users.  The Software and Documentation \r\nqualify as \"commercial items,\" as that term is defined at Federal Acquisition \r\nRegulation (\"FAR\") (48 C.F.R.) 2.101, consisting of \"commercial computer \r\nsoftware\" and \"commercial computer software documentation\" as such terms are used \r\nin FAR 12.212.  Consistent with FAR 12.212 and DoD FAR Supp. 227.7202-1 through \r\n227.7202-4, and notwithstanding any other FAR or other contractual clause to the \r\ncontrary in any agreement into which this End User License Agreement may be \r\nincorporated, Licensee may provide to Government end user or, if this Agreement \r\nis direct, Government end user will acquire, the Software and Documentation with \r\nonly those rights set forth in this End User License Agreement. Use of either \r\nthe Software or Documentation or both constitutes agreement by the Government \r\nthat the Software and Documentation are \"commercial computer software\" and \r\n\"commercial computer software documentation\" and constitutes acceptance of the \r\nrights and restrictions herein.\r\n\r\n7.\tDISCLAIMER; LIMITATION OF REMEDY.  EXCEPT FOR THE WARRANTIES \r\nSPECIFICALLY DESCRIBED HEREIN, F5 AND ITS THIRD PARTY LICENSORS DISCLAIM ANY AND \r\nALL WARRANTIES AND GUARANTEES, EXPRESS, IMPLIED OR OTHERWISE, ARISING, WITH \r\nRESPECT TO THE SOFTWARE, DATA, SPECIFICATIONS, OR DOCUMENTATION DELIVERED \r\nHEREUNDER, INCLUDING BUT NOT LIMITED TO THE WARRANTY OF MERCHANTABILITY, \r\nWARRANTY OF NON-INFRINGEMENT OR TITLE AND THE WARRANTY OF FITNESS FOR A \r\nPARTICULAR PURPOSE.  F5 MAKES NO WARRANTY CONCERNING THE COMPLETENESS OR \r\nACCURACY OF THE DATA OR INFORMATION OBTAINED OR DERIVED THROUGH THE USE OF \r\nTHE DATA INCLUDED IN THE SOFTWARE AND THE DATA IS PROVIDED \"AS IS\".  \r\nF5 HAS NOT AUTHORIZED ANYONE TO MAKE ANY REPRESENTATIONS OR WARRANTIES \r\nOTHER THAN AS PROVIDED ABOVE OR TO OTHERWISE MODIFY THE TERMS OF THIS LICENSE.  \r\nTHE COLLECTIVE LIABILITY OF F5 AND ITS THIRD PARTY LICENSORS UNDER THIS \r\nLICENSE FOR PERPETUAL LICENSED SOFTWARE WILL BE LIMITED TO THE AMOUNT PAID \r\nFOR THE SOFTWARE.  THE COLLECTIVE LIABILITY OF F5 AND ITS THIRD PARTY \r\nLICENSORS UNDER THIS LICENSE FOR  SOFTWARE OTHER THAN PERPETUAL LICENSED \r\nSOFTWARE WILL BE LIMITED TO THE AMOUNT PAID FOR THE SOFTWARE IN THE TWELVE \r\n(12) MONTHS PRIOR TO THE EVENT GIVING RISE TO THE CLAIM.  F5 AND ITS THIRD \r\nPARTY LICENSORS WILL NOT HAVE ANY OBLIGATION OR LIABILITY, WHETHER ARISING \r\nIN CONTRACT (INCLUDING WARRANTY), TORT (INCLUDING ACTIVE, PASSIVE OR IMPUTED\r\n NEGLIGENCE, STRICT LIABILITY OR PRODUCT LIABILITY) OR OTHERWISE FOR ANY \r\nPUNITIVE, EXEMPLARY, SPECIAL, INCIDENTAL, CONSEQUENTIAL OR INDIRECT DAMAGES, \r\nINCLUDING BUT NOT LIMITED TO LOSS OF USE, LOSS OF DATA, BUSINESS INTERRUPTION, \r\nLOSS OF REVENUE, LOSS OF BUSINESS OR OTHER FINANCIAL LOSS ARISING OUT OF OR \r\nIN CONNECTION WITH THE SOFTWARE OR OTHER GOODS OR SERVICES FURNISHED TO \r\nLICENSEE BY F5, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. TO THE \r\nEXTENT PERMITTED BY LAW, F5'S THIRD PARTY LICENSORS WILL NOT HAVE ANY \r\nLIABILITY FOR ANY DIRECT DAMAGES OF ANY KIND UNDER THIS LICENSE AGREEMENT.  \r\nTHE LIMITATIONS CONTAINED IN THIS SECTION WILL APPLY NOTWITHSTANDING ANY FAILURE \r\nOF AN ESSENTIAL PURPOSE OF ANY LIMITED REMEDY PROVIDED UNDER ANY TERM OF THIS \r\nAGREEMENT.  SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF \r\nLIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES. IN THOSE JURISDICTIONS, \r\nSUCH INAPPLICABILITY WILL NOT AFFECT THE REMAINDER OF THE PROVISIONS IN \r\nTHIS SECTION.  \r\n\r\n8.\tNon-Production Use Software.  If Licensee purchases an F5 Product or \r\nlicenses F5 Software designated as \"non-production,\" \"non-commercial,\" \"lab\" or \r\n\"development\" Product in the applicable purchase order, quote or the license \r\nfile for such Product or Software (\"Non-Production Software\"), Licensee may use \r\nthe Software included with such Product to conduct testing and development in \r\nLicensee's non-production environment only and not to manage data traffic or \r\napplications in the ordinary course of Licensee's business.  Licensee agrees \r\nthat any use of Non-Production Software in violation of the preceding sentence \r\nis a material breach of this Agreement.\r\n\r\n9.\tEvaluation Software.  If the Software is \"Evaluation Software,\" \r\nnotwithstanding any other terms to the contrary in this Agreement, Licensee may \r\nuse the Software only for its internal demonstration, test or evaluation \r\npurposes and not in a production environment.  NOTWITHSTANDING ANY TERMS TO THE \r\nCONTRARY IN THIS LICENSE, F5 DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, FOR \r\nEVALUATION SOFTWARE AND IT IS PROVIDED ON AN \"AS IS\" BASIS. EVALUATION SOFTWARE \r\nHAS A NON-PERPETUAL TIME LIMITED LICENSE THAT WILL \"TIME-OUT\" AND DISABLE THE \r\nSOFTWARE UPON EXPIRATION OF THE EVALUATION PERIOD.  Licensee agrees that it will \r\nnot attempt to defeat or circumvent any duration mechanism for evaluation \r\nSoftware. Licensee also agrees that it will not use any evaluation Software \r\nbeyond the prescribed license duration.\r\n\r\n10.\tSoftware Hosted in a Public Cloud.  If the Software is used in a cloud \r\nor similar environment, Licensee may only use the Software in object code form \r\nin the cloud provider's (\"Cloud Provider\") environment. Licensee agrees it will \r\nnot transfer any part of the Software out of the Cloud Provider's environment.  \r\nLicensee may use multiple instances of the same Software in object code format \r\nin the Cloud Provider's environment, paying for each instance separately. \r\nIN ADDITION TO THE DISCLAIMERS SET FORTH IN SECTION 7 ABOVE, AND NOTWITHSTANDING \r\nANY TERMS TO THE CONTRARY IN THIS LICENSE OR ANY REPRESENTATIONS OR WARRANTIES \r\nOF THE APPLICABLE CLOUD OR SIMILAR ENVIRONMENT, THE SOFTWARE IS PROVIDED \"AS IS\" \r\nAND POSSIBLY WITH FAULTS.  \r\n\r\n11.\tTermination.  The license granted in Section 2 is effective until \r\nterminated and will automatically terminate if Licensee fails to comply with any \r\nof the terms and conditions set forth herein.  Upon termination, Licensee will \r\ndestroy the Software and documentation and all copies or portions thereof.\r\n\r\n12.\tSupport.  Maintenance and support of the Software is not provided under \r\nthis License and must be purchased separately subject to F5's support policies \r\navailable at http://www.f5.com/about/guidelines-policies/ and http://askf5.com   \r\nWhere Licensee has purchased maintenance and support for a Product, the term \r\nSoftware under this License will include any published updates, corrections, \r\nnew releases and new versions of such Software (collectively \"Updates\"), \r\nprovided that Licensee is otherwise entitled to access and use such Updates \r\npursuant to the applicable maintenance and support contract.  Licensee may \r\nonly use the Updates on Products for which Licensee is the original end user \r\nor other Products which include Software to which Licensee holds a valid \r\nlicense, and only on equipment for which Licensee has purchased maintenance \r\nand support.  Permissible upgrades for virtual edition licenses are further \r\ndescribed at \r\nhttp://support.f5.com/kb/en-us/solutions/public/15000/600/sol15643.html.\r\n\r\n13.\tMiscellaneous.  This License will be governed and construed in \r\naccordance with the following governing law (\"Governing Law\"), depending on the \r\napplicable licensing F5 entity, without regard to its choice of law rules:\r\n\r\nLocation:\r\nGoverning Law:\r\nVenue:\r\nF5 Networks Singapore Pte Ltd\r\nThe laws of Singapore\r\nSingapore\r\nF5 Networks Ltd.\r\nThe laws of England and Wales\r\nLondon, England\r\nF5 Networks, Inc.\r\nThe laws of the State of Washington\r\nSeattle, Washington\r\n \r\nThe provisions of the U.N. Convention for the International Sale of Goods and \r\nthe Uniform Computer Information Transactions Act, in whatever form adopted, \r\nwill not apply and the parties specifically opt out of the application of such \r\nlaws.  In the event of any dispute arising out of or relating to this Agreement, \r\nthe parties shall seek to settle the dispute via direct discussions.  If a \r\ndispute cannot be settled through direct discussions, the parties agree to \r\nfirst endeavor to settle the dispute via voluntary non-binding mediation, \r\nbefore resorting to arbitration.  A mediator will be selected by voluntary \r\nagreement of both parties, or in the event both parties cannot agree on a \r\nmediator, a mediator will be selected in accordance with the rules of JAMS.  \r\nThe mediation shall be held in the applicable venue (\"Venue\") identified in \r\nthe chart above.  Each party shall bear its own costs and expenses and an equal \r\nshare of the administrative and other fees associated with the mediation.  \r\nAny dispute that remains unresolved following mediation shall be settled by \r\narbitration administered by the JAMS in accordance with its Comprehensive \r\nArbitration Rules.  The place of arbitration shall be the applicable Venue.  \r\nJudgment upon the award rendered by the arbitrator(s) may be entered in any \r\ncourt having jurisdiction thereof.  The arbitrator(s) shall award to the \r\nprevailing party, if any, as determined by the arbitrator(s), all of its \r\ncosts and fees.  \"Costs and fees\" mean all reasonable pre-award expenses \r\nof the arbitration, including the arbitrators' fees, administrative fees, \r\ntravel expenses, out-of-pocket expenses such as copying and telephone, \r\ncourt costs, witness fees, and attorneys' fees.  In rendering the award, \r\nthe arbitrator(s) shall determine the rights and obligations of the parties \r\naccording to the substantive and procedural laws of the applicable Governing \r\nLaw.  The foregoing alternative dispute resolution provisions will not apply \r\nto claims or actions related to the infringement, misappropriation or \r\nviolation of F5's intellectual property rights or those of its third \r\nparty licensors and such actions may be brought in any court of competent \r\njurisdiction.  Any provisions found to be unenforceable will not affect the \r\nenforceability of the other provisions contained herein, but will instead be \r\nreplaced with a provision as similar in meaning to the original as possible.  \r\nThis License constitutes the entire agreement between the parties with regard \r\nto its subject matter.  No modification will be binding unless in writing and \r\nsigned by the parties.\r\n\r\n14.\tAcknowledgements.  The Software includes Data and software developed by \r\nthird parties subject to separate licenses.  Please reference the applicable \r\nProduct's Open Source Notices and Software Acknowledgments document available \r\nat http://askf5.com.\r\n\r\n15.\tOpen Source Components. Certain portions of the Software contain open \r\nsource software (\"Open Source Components\") that are licensed under the terms of \r\nthe applicable open source licenses. The terms of the applicable licenses of the \r\nOpen Source Components take precedence over the terms of this License, only to the \r\nextent the terms of this License are not permitted by the applicable licenses of \r\nthe Open Source Components.  A listing of the Open Source Components can be found \r\nin the Documentation.  To the extent the terms of the applicable licenses of the \r\nOpen Source Components require F5 to make available to Licensee the corresponding \r\nsource code and/or modifications (the \"Open Source Code\"), Licensee may obtain a \r\ncopy of the applicable Open Source Code from its current location at \r\nhttps://downloads.f5.com, or by sending F5 a written request with Licensee name \r\nand address to: F5 Networks, Inc., Attn: Office of the CTO, 401 Elliott Ave W, \r\nSeattle, WA 98119.  All requests should identify: the Open Source Code that \r\nLicensee is requesting, the applicable F5 product (and any available version \r\ninformation) Licensee has licensed from F5 in connection with the requested \r\nOpen Source Code, Licensee?s email contact information, and the postal address \r\nfor delivery of the requested Open Source Code to Licensee.  This offer to \r\nobtain a copy of the Open Source Code is valid for three years from the date \r\nLicensee licensed the Software."
}
